{"pages":[{"title":"share","text":"","link":"/bangumi/index.html"},{"title":"about","text":"关于这个博客搭建网站放在GitHub上，博客由Hexo生成，现在使用的主题是在“水寒”基于Icarus主题修改的基础上保留首页格局写的，可能还有一些bug存在，后续会慢慢开发完善的。用hexo+github可以很方便地搭建一个个人博客网站，不需要购买域名和服务器，网上有众多相关的详细教程，可以自行查阅参考。附：Hexo：https://hexo.io/zh-cn/Icarus：https://blog.zhangruipeng.me/hexo-theme-icarus/水寒的博客：https://dp2px.com/ 用途分享生活，留住感动。（没错，就是QQ空间的slogan）会分享一些自己的爱好，记录自己在地球上留下的足迹，写写记录心情的博客，至于技术，计算机方面我是个小白，大家一起努力。 关于我儒雅随和:)","link":"/about/index.html"},{"title":"links","text":"","link":"/links/index.html"}],"posts":[{"title":"建站日志","text":"2020.5.22 Friday 昨天忙活了一天终于把网站弄好了。 好像是在哪看到一个建自己的博客网站的教程，然后突然想自己搞一个，可能也因为几周前看到卢某也搞了一个，感觉蛮有意义的，就开始研究着怎么做了。 一开始看到是用“GitHub”弄的网站，但首先看到的是要用什么“jekyll”，好像是因为下载太慢了下不动，然后有看到另一种用“hexo”做的，想着还好我只注册了GitHub还没搞别的，然后就直接转用hexo做了。也是各种搜教程，然后通过B站的一个视频安装了hexo，sublime，然后又更换了“next”主题。后面想着找有没有其他更好的主题模板，然后看了所有的三百多个主题也没挑出几个，最后看“辣椒の酱”的blog网站感觉做得挺好的，也有后续自定义的教程在里面，然后就想换成他用的原主题——“icarus”。但好像是不懂要安装什么东西，换完后运行的时候一直报错什么什么is not nstall。反复试了几种方法也弄不来，然后就打算先用着next咯，反正能发挥的空间还是挺大的。然后弄着弄着突然发现了什么东西没下，就百度一下那串英文，后面看到一个相关的但是另一个问题的提问，突然灵光一闪，复制了那个代码放进去运行一下，再让hexo运行一下，竟然没出bug了，很开心，终于用上心心念的主题了。 然后就是看Icarus里面的教程，辣椒の酱的教程，还有“水寒”的教程，多多少少改了一点，最后直接克隆水寒的版本，能省很多后续优化美化的时间，但因为功能更多，里面也有更多的东西需要处理一下，今天下午大概把头像，ＩＤ，链接，广告位，书籍等等改了一下，链接下面的两个教程的链接让我很是头疼，找不到去掉的方法，实在不行做好去掉链接的侧边栏的打算了，其实对我没什么差。接着把分类和归档的分页弄了一下，还没搞好，其他的也还不懂怎么弄，以后再看看教程，实在找不到感觉可以去next那里看一看。然后看到别人有看板娘的插件，还是想搞的，虽然有点花里胡哨，不过目前只大概做好了首页的页面，也花了蛮多时间的，游戏都玩少了，以后再说吧，还是有蛮多教程的，应该不难。 感觉刚接触还是蛮有兴趣的，早上爬起来就开始继续研究这个，还是蛮有成就感的吧，因为没学过网页设计，多少能整出一个自己的网站了。不过明天周六我得赶紧把我的课程论文写了，虽然要两千个词，八篇文献，但我毕竟是老裁缝了，前两周多少完成一大半的工作量，争取明天搞定了。这几天都聊天到很晚，没什么精神，欠了一些视频得周日看看多少补一些，不然期末快来了得完蛋。 等等十点向往的生活要播辣，我休息会去看看，然后舒舒服服的睡一觉，希望今天能睡早点。 感觉这个写得都不像建站日志了，然后整个文章里面有好多“然后”，不过也没差了，反正是自己看的又不是拿去作文评分的，然后就然后吧。 就这样。 control＋ｓ！ 2020.5.24 Sunday早上 终于把论文基本写好了，明天（今天）再抽点时间再看几遍改一改就好了，下周要考试得赶紧去看一看材概的东西。 现在都快两点了，还好有朋友陪着我聊聊天，晚上做饭手还被烫到了，现在好多了，挺影响效率的。 今天（昨天）早上还是没忍住起来研究这个网页，毕竟这个是第一次自己做的网站，跟亲儿子一样，看着他一步步地被完善美化很爽的，想过虽然这样“硬核”地写博客什么的相比于在QQ空间发说说、在新浪发微博会麻烦点，但可能这就是“男人的浪漫”吧，还是很有成就感的。今天也还是做了蛮多事情的，发现分类页面直接加一个categories就行了，然后在侧边栏的文件里找到那个之前怎么都去不掉的原主题使用者留下的链接，毕竟这个不是Icarus给的主题，直接clone做好些的省去了许多添加优化的时间。然后就是看板娘了，看到一个简简单单的教程，就直接做了，其实Icarus有自带这个插件好像，把live2Dswitch打开就好了，不过只有一个角色，后面有时间想换角色或添加其他功能什么的再慢慢搞。不过我把移动端的显示关闭了，我的华为手机自带的浏览器还是显示出了看板娘，而换用百度打开就不会显示了。还有就是“不蒜子”的计数了，看了感觉挺简单的就打算顺手做了，代码放进去发现不行，百度了一下才知道原来是他们的网址过期了，换了新网址发现给出来的在右下角，而且样式和布局很怪，我还不会调整这个，想到原主题好像已经安装了这个插件，就去首页的页面文件看一下，然后直接打开就ok了，在页面左下角，字号也跟其他的一样，不过就是我看到的访客量都巨大，以为是原主题使用的网站保留的数据，后来还是在万能的百度上看到了说根据网址计算的，因为我是直接在本地看的，localhost很多号码端口都挺多人用过的，我直接同步一下开在线网页看了，就可以了。下午多少研究了一下相册的分页功能，找了找教程不算很少，比较了一下感觉都挺麻烦的，选了一个看起来简单的，是用python写的脚本，因为我编程语言选的python，就有种亲切感，不过还是看不懂啊，我才学了十几周还不会这些复杂一点的操作。按照上面的过程做了一下发现不行，其中一个把git配置到环境变量我不会搞啊，那些语句我也在所有作者提供的脚本里搜不到，也不知道该放在哪，毕竟还有别的事要干，就先告一段落了，这些做完了是一个空的相册界面，图片按照格式修改了也不行，试过很多文件夹了，下次再看看。 就先这样吧，两点多了，我赶紧去睡觉了。good night. 晚上 突然想到忘了搞论文了，等等还得去稍微看一下，明天争取能交上去了，毕竟得留点时间看材概，突然有点慌，平时分还不知道是什么状况。 早上起来大概写了一下关于界面，然后开始看相册怎么搞，试了很多方法，不过搜到的本主题的教程挺少的，甚至后面还试了其他主题的，最后选择不做相册了，仔细想想没有很大的必要，照片完全可以放博客页内的，也方便记录，而且照片放多了会影响页面加载速度，想到这里直接把相册页面注释掉了，没必要再浪费更多时间在这个上面。中间又给网页换了个图标，可以格式工厂直接转或者网上找现成的，不过格式工厂压出来的ico格式的图完全就是马赛克，最后选择了网上找，不过网上找到图下载下来是GIF格式的，转出来还是马赛克，不过因为图案简单的原因，至少看起来好多了，我选了个WiFi断连的图标，感觉挺有意思的，先用着吧，以后有什么好主意了再换上。还大概在分享界面加了个番组计划的模块，但好像也是别的主题的，在我这里展现出来的效果很一般，下次再慢慢做吧，这种东西无需一次做完，慢慢完善的过程也挺享受的。至此我的博客已经基本做好了，接下来就是做内容，还有就是鼠标指针移到头像时的显示问题，从原主题遗留下来的，还有就是最新文章处没有缩略图的展示，这个更不用急，影响不大。live2D可以换一下角色，增加功能的话看有没有给和是否麻烦了，不过目前的这个也挺好的，就是语音互动感觉很怪，有点生硬。 大概今天做了这些调整吧，赶紧去看论文，现在十点还有点时间。 2020.5.25 Monday 不知道为什么部署到GitHub上经常出错，账号密码都是填对的，也许是网络问题。 2020.6.1 Monday 终于考完材概了，昨天想尝试换“Sakura”主题，因为现有的主题分享页面的展示不是很好，我又不会写。昨天大概试了试，早上也换了一下，结果运行的时候每个小文件夹的“index”文件都报错了，我改了一些地方也不知道哪里有问题，后面想了想还是换回现在用的“Icarus”主题吧。也因为Sakura有点太花里胡哨了，也不是不好，不过博客还是以内容为主，现在简洁的界面也还不错。幸好我换之前记得整个文件备份了，不然再换回来属实不容易，网站算整体做好了，接下来就是放内容和后续再慢慢优化一些地方了。 分享界面想多做一个模块，试着复制粘贴了一份代码放在下面，发现网页多出来了一部分一模一样的在下面，然后想着另建一个文件夹放内容，后面怎么试都不行，甚至报错都是红色的字体了。然后想了想试试在原文件里面分出来一个，搜索那个bangumi的然后试着一个个地替换成新模块的名字，发现可以了，就很舒服一下子解决了，大概解决问题了，封面图片展示可以有但不是很必要的，就先这样吧。还有就是发现photo文件夹里面的文件好像运行的时候自己同步了，三个文件里面的照片都是一模一样的，也没什么差影响不大。 还有，不蒜子好像有时候显示计数有时候又不显示了。网站加载需要网络好，网不好会加载半天，东西一部分一部分地出来。 cmd命令界面的显示我找到源文件了，直接改掉了，虽然挺有特色的不过显示得不好，位置有点错乱了，而且这个好像也只有我运行的时候看得到，直接删了换成英文名。 2020.6.4 Thursday 微信的浏览器打开也会显示看板娘，挡了一大部分视线，不过我也还是不知道怎么解决，可能浏览器的手机标识不全？ 2020.6.11 Tuesday 改了网站名称，诶嘿嘿","link":"/2020/06/01/%E5%BB%BA%E7%AB%99%E6%97%A5%E5%BF%97/"},{"title":"测试","text":"阿萨德瓦达","link":"/2020/05/23/%E6%B5%8B%E8%AF%95/"},{"title":"Informal Essay","text":"2020.6.3 Wednesday 刚刚看了青春猪头少年真的是涕泪俱下，前面有一段大哭，剧场版小哭。总体的感觉整个动漫并不是风平浪静的比较慢节奏的，各种离奇的事情也一件事接一件事地到来，也通过这些事情慢慢地认识每个角色。还有，里面各种解释都是量子力学和相对论什么的，感觉像是一个科普片？还有点莫名其妙跟着剧情稍微懂点这些概念了，刚好最近物理也在学相对论，感觉有点亲切。 作为老白嫖怪今天开始等着领守望先锋，不过页面估计登的人太多了，一直进不去，进去了几次也都没有成功，从99%，89%，等到69%，后面想了想下次再领，先别一直浪费时间，虽然游戏的确有点凉了，但我还是挺想玩的，不过有可能没人一起玩就是了，确实这游戏是挺捞的。 2020.6.7 Sunday 终于领到守望先锋了，不过硬盘里之前剩十几Ｇ，同学拉我去玩valorant,把两个放视频的文件夹删了才下了，然后刚好昨天有玩了一下鬼泣5，想了想干脆把鬼泣通关了再删掉，然后就差不多玩了一天打完了，最后结尾的时候感觉做的挺好的，剧情还不错，结尾是隐藏了战斗时的各种属性栏，然后画面上浮着制作成员什么的，然后几乎放了所有的小怪，让我们觉醒了恶魔力量的Nero去打，没什么压力感觉挺有意思的，让人放松的同时还能放放信息，后面就是像电影结束后一样的文字和图片放映，然后给个配角的小彩蛋。打完了意思是让我用能化魔的Nero打二周目，我肯定不想再玩一遍，游戏感觉还是用手柄玩比较好，有些技能键盘不好放。总体还不错吧，我刚玩的时候感觉好恐怖啊，玩着玩着感觉有些怪有些场景和交互什么的好恶心啊，又觉得很下饭可是却很喜欢哈哈哈，再玩到后面就感觉习惯了，没什么感觉。删了游戏突然D盘有了50G的空间，可以直接下守望先锋了，虽然玩的人少了，不过我高中的时候有几次还是借同学号玩的，以前没怎么玩，现在能免费了还是想玩玩。赶紧溜了去写化学了。 2020.6.9 Tuesday 上个网课亲眼见证着一百多人的群在线观看为二十几，并且刚看几分钟，弹幕数从二十几增加到了三十几，笑死我了，虽然我也挺划水的。 感觉我有点晕GTA，玩一段时间就会有点累，其他FPS游戏都还好，可能是我亮度调太亮了，之前进游戏前让我调的明暗对比，我为了体验好点可能调得偏亮了，所以正常玩的时候夜晚会有点暗，屏幕亮度自然也往上调了，得看看在哪里能改一下。 昨天终于玩上了守望先锋了，拿了几个全场最佳感觉挺激动的，虽然好像我等级低都是跟一堆新手玩，但还是很开心。不过这两天感觉玩得多了，学得少了，想想下周考python我还没开始看题目就有点慌。 今天打算同步一次，然后就找了张图片做展示图，大概把背景又虚化了一下，人物显得更清晰了，总体感觉有比虚化前好，图片本来就很好看了，我就也没再调什么参数。 提交的时候提交不了，显示nothing to commit, working tree clean，去百度一下看是什么原因。 哈哈哈原来是我密码真的输错了，我还百度查了好久，然后有一个回答是可能密码输错了，赶紧去GitHub重新登了一下才发现，笑死我了，浪费了十几分钟。 2020.6.11 Thursday 我还以为python上完了，昨天看最后一周的题发现好像没教，早上老师才又让我们看，不过这些第三方库的使用也没录视频，就给了两百多页的PPT让我们自己看，然后下周一马上考画图？感觉还是挺难的，不过如果以周四前准备倒还好，这几天可以先研究一下后面的，然后周一到周三复习前面的，可是我好像也只有周三有点空闲，周一如果数学结课了倒也还好，唉感觉Ｐ给的压力还蛮大的，考试时间也感觉写不完，除非给的题目会简单一点，应该也不会给难题，实验课的随堂测试三节课就给了两题，考试就两小时还给了六题编程题十五题选择，如果难的话应该是做不完的，大概最多一题难题吧，或者说一半以上中等题，倒还合理一些。 化学练习册自己买的版本跟学校出的课本不一样，后面挺多是书上没有或者书上有练习册没有的，先把有的看着吧，后面都看完了在找找其他地方有没有题目。 2020.6.13 Saturday 昨天玩了一天啥都没干，真就当暑假过了。今天也差点一直玩下去，想到python还很多不会就刹住车了。Mojito三块钱一首歌我买不起，然后就去B站找个MV循环播放，边看东西边听还不错，虽然听歌肯定会影响，不过这歌太上头了。刚好守望先锋里有一张地图是Havana，而且进地图的音乐的风格也有点像歌里的配乐，地图场景和MV里的场景我倒是还没认真去看，感觉挺亲切的。 ｇｏｇ送了鬼泣５，虽然是２０１２年的游戏，而且破解版也早就有了，不过还没玩过杀手系列，而且看过杀手的电影，看过老番茄的杀手系列搞笑的视频，还是像进去玩一下的，等暑假慢慢来吧，反正是单机游戏。 2020.6.17 Wednesday 昨天买了剃须刀第一次剃了胡子，感觉整个人都变年轻了，下巴摸着有点怪，感觉没胡子了有点不习惯。 同学说明天考完后面python还得再考一次，我还以为考完就可以专心复习化学了，我一开始喜欢python多于化学，现在反而喜欢化学多于python了，因为有时间可以安排的话，我更喜欢学化学，没错就是学，而不是复习，之前看视频听老师讲不算认真，而且有的东西当时懂了后面又忘了，看书多一些细节的东西，然后还能看看思考题，里面有一些值得注意的地方，还不错吧，然后我真就得速成化学了，前面几天先把书看了，后面再找找题目写一写。 2020.6.21 Sunday 今天有日环食，不过我下午睡着了，醒来只剩一个胖胖的半个太阳，不过还不错，睡得挺舒服的，心情好。 最近找到了一套doggie的壁纸，一整套我都觉得很可以，那些停顿，动作，还有音乐都很好，之前只是因为看到一个自己喜欢的主播也用的壁纸其中之一才订阅的，后面发现这个作者有做其他的，然后都下下来看了一下，这个画风也让人很舒服啊，有夏日的慵懒，有善良的内心，还有一些搞怪的情节，当然这些BGM也是很有感觉的，有的还有搭配上动画。 化学课本上有好多地方有问题啊。 2020.6.22 Monday 内存条到了，第一次拆开电脑，幸好有拨弦的拨片，开卡扣挺方便的，不过毕竟是第一次拆，我还怕弄断了，螺丝感觉都挺软的，我得往下用点力，不然怕磨坏了拔不出来就完了。后面旋上去的时候也是不敢旋太紧，宁可掉了也不能拧不出来。那个内存屏蔽罩是真的难拆，我可能花了有二十分钟在研究这么拆，主要是怕弄坏主板，不然拿个东西撬一下大力出奇迹就行了，后面好像是用指甲伸到缝里把整个抠出来，上面沾着的指纹什么的弄不掉啊，刚拆开的时候是干干净净的一片金属，装回去的时候上面都是脏脏的痕迹了，可能是油还是什么。内存条挺好插的，放进去往下一按两边自动伸出去又夹紧。清灰的话我没买工具也说实话有点懒得拆风扇导热管了，不过电脑买来也快一年了，是应该清清灰了，硅脂我不知道是不是也得看一下要不要换，的确老电脑没有新买了的那样感觉性能好，也可能我习惯了快速运转的电脑吧偶尔卡一卡都不习惯了。最后装回去也挺舒服的，按一下卡扣就自己进去了。 后面又给手机贴了个膜，之前没手机自然也就没贴过膜了，原厂自带的玻璃膜被我划出了很多痕迹，看一下大概知道是两个地方是玩王者荣耀等游戏留下的，好像我也没玩什么其他的手机游戏了，还有一个就是日常用手机上下滑的竖直的痕迹了。主要是感觉变粗糙了，我玩游戏都很受影响，嘿嘿。把膜后面的撕开，放到手机上自然地就自己粘住了，不过会留下一圈的白边，有送白边液就是了，沿着膜边缘涂一下很快就好了，也会留下一条靠里面的线，按压一下也就没了，不知道这个“白边液”是什么东西，后面再去查查吧，觉得挺有意思的。最后发现左上角那里有三个小点，好像是气泡还是粘了灰尘或其他脏东西什么的，也没办法了，只能等下次换膜的时候了，简直强迫治强迫症，也还好吧，不仔细看不影响，总体算成功的吧，贴之前感觉翻车的几率挺大的，其实还好。 还有发现领的泰斯卡斯凯岛单一麦其实早就到了，有一说一让我分出威士忌和其他烈酒就不错了，细品那些味道我真的不太会，也因为没怎么喝威士忌吧，我感觉喝起来和罗曼湖十年没什么差？也许是没对比吧，罗曼湖挺久以前喝的了，记不太清了哈哈哈。 下午没干什么事，写了实验报告今天也没看什么课本的内容，都22号了，我算一下，剩六天了？晚上争取第七章看完，明天努力一下看能不能第十章看掉，主要不是时间问题，我也没玩很久游戏，就看一会做点别的事，手机拿起来得几十分钟后才能放下，唉，反正该做的题还是得做一下，还有前面看完的很多很容易忘掉，得认真点总不能挂科吧，我前面平时分的东西做挺差的，期末考就不能划水了。 2020.7.1 Tuesday 不知不觉都7月了，想想去年这个时候，好像和现在没什么变化，又好像变了很多，经历了更多，看到了更多，似乎这几年来每年都有挺大改变的，不同于高三，花在学习上的时间少了，花在兴趣上的时间多了，啊这又不是什么年终的总结，没必要盘那么多。 前天终于考完了化学，我真的有点读抑郁了的感觉，到今天好多了了，不过也就是说这两天什么事都没干，可能因为从高三的学习强度到大一上学期在校的学习强度，又到现在网课几乎在摸鱼的状态，久没读书了突然看久一点心情的不好了。下周一就要考python了，可能因为复习有点无从下手，感觉有点消极对待python了，也有可能因为前面一次考python花了一些时间去复习，又觉得自己行了？总之还是得好好看看题吧，多少看点，看多少算多少总会比没看好一点。 突然想到其实可以开始捡起来一些想做的事来做了，比如锻炼一下，不过我等等去看看体重，希望别又瘦了，也好久没跑步了，暑假我可能想去市区住，当然一个是因为网络好，好多竞技游戏很久没玩了，然后是想自己挑战一下每天自己做做饭，然后下午可以去小公园跑一跑，应该能有不错的收获，不过可能一放假就也得慢慢学数学物理英语的内容了，后半学期我知道了到学校再考试的消息后基本没怎么学了，真就是得预习一遍，化学一本书我可能分十天才看完，这三科只要有坚持一下应该没什么问题，三科两个月刚好，其实我还是觉得得抓紧时间，因为前半学期有好好听课的内容也不太记得了，看书或看视频还是得从头开始。 七月感觉可以出去和同学一起玩了，不过没什么钱就是了，花了就没钱攒了，打工的话我感觉可能不一定去吧，我反正不主动寻找，除非有什么很合适的机会，去一下也还好，干点正事还能赚点钱说不定想去哪里玩还能再一起出去。 2020.7.10 Friday 今天看了霸王别姬的电影，看得挺累的，一个是因为时间长，前后加起来有快三个小时了，总体的感觉是血腥暴力压抑吧，似乎是以时代为线索，从日本人进城，国民党进城，解放军进城，再到后面文革。本来能越发健康的关系因为环境的不同一步一步恶化，也不一定是坏事，更生动了人物的形象。也有一些次要人物也很立体，对其有爱有憎。还是很震撼的吧，幸好在朋友推荐下看了，没看也挺可惜，细细品应该有更多细节能体会到的吧，这部电影绝对不输国外的其他所谓大片，不过短时间内不会想看第二次的，真的看得挺难受的。不是专门做影评，不用记录那么多剧情相关的，不然能讲的实在是太多了。不像流行歌曲里面唱的“唱悲欢，唱离合，无关我”故事本身发生的，携带的，蕴含的比霸王别姬的场景多了太多太多，两位“名角儿”并不能专心唱自己的故事，受台下的汪洋波涛冲击着，摧残着，戏里戏外，也似乎成为了一致。 2020.7.19 Sunday 在市区待了几天，不过也没玩啥电脑游戏，手机玩得多些，这几天得开始读读物理了，数学晚点再说吧，感觉很久没碰挺难的。不过也可能因为夏天热，还是没怎么看，算了一下认真看一看十天左右还是能读完的，不过没有像之前临考试那样紧迫，这个月不一定能看完，唉也得慢慢增加一点。 王者荣耀最近多少多打一点排位了，没有像之前大多是跟同学打上去的，所以比较怕输，也因为赛季初吧，段位本来就很低，掉一掉没什么影响。然后同学说了一下突然想起了原来打野位可以玩工具人，不一定要玩刺客，可能刺客英雄我大多玩不来，或者说发挥不稳定所以胜率不算高。所以现在算是每个位置都能打了。而且还发现我单排其实胜率不比开黑低，那就无所谓了，反正熟练度低的没什么英雄想玩的，打打排位也不错。 2020.7.22 Wednesday 前两天看了《路人女主的养成方法》两季和剧场版，第二季bilibili要会员，然后就去小网站上看了，剧场版的话国内还没有，找了半天都是同一个资源，手持拍摄的荧幕，然后有人听声音加字幕。虽然体验不太好，会晃来晃去的，还有part2的最后一小段没字幕，日语完全听不懂，也还好吧。 感觉整个故事下来剧情还是不错的，挺多地方是出乎我意料的，女主的性格更多是后半段才显露出来，毕竟前面也顾着讲述男主和其他不“普通”的人设的故事，也算为观众看懂女主的内心做铺垫了，我眼中的女主似乎并没有像霞诗子说的那些腹黑等等（什么的我忘了），不过性格上的“极端”或者说叫倔强部分还是有的，同男主一样是个能够吸引别人的性格。加上剧场版后，整个故事也很饱满了，并不是每一阶段都是如同多数人想象中的只是该有的内容，难过处有令人开心的地方，本是欢乐的时候确又有让人难过的地方。总的来说感觉每个人的情感还是刻画得很好的，主要人物之间的各种关系，也有一些令人出乎意料的场面，还有呼应前面的令人喜悦的内容，还是很多地方让我感动的。没有更快地看完主要还是因为挺多是令我难过的，所以没有紧接着看下面一话，也刚好“消化”一下前面看到的，一次性太快的看完也可能会忽略很多东西吧，刚好也想想。 总的来说还是很喜欢的，各个人物，美好的细节，细腻的情感，不过这个动漫也给了太多“福利”吧？让我都怀疑是不是搞错了，前期挺多内容是要加好多条白光来代替掉马赛克，也只能说是制作者为了吸引读者吧。汗。。。第一季在B站上看的，有弹幕的感觉还是不错的，看弹幕搞怪，也像是有人在一起看。后面没弹幕了，还是挺怀念有弹幕的时候，可惜我没钱充大会员。也还好吧，老“白嫖怪”了，我自以为的我的一个优点就是基本给手机APP充钱，这个还是不错的，能把闲钱空出来用到其他更需要的地方（比如出去玩哈哈哈）。唉就这样吧，剧情方面也不想写啥，反正忘了就忘了吧，留下好的记忆就行了。 2020.7.29 Wednesday 真爱至上真的很治愈人，很浪漫，很轻松很欢快，表现了不同的关系，不同的阶段，不同的职业，不同的年龄间的爱，也许夹杂着一些悲伤，还是很鼓舞人感动人的，也展现了一些例如国家，种族等的内容，还是展现出美好的圣诞和美好的感情。还有就是影片的音乐也很好，让人也代入进故事的情感，虽然有些内容在爱奇艺上看被剪掉了，不过也没差了，大体想表达的我感受到了。很浪漫很轻松，也刚好分了好多段故事，不会很复杂，就真的如同看电视喜剧那样，刚好和上两部影片的相对沉重中和一下。开心开心开心！","link":"/2020/06/03/Diary/"},{"title":"Hello World","text":"Writingnew_post_name: :title.md # File name of new postsdefault_layout: posttitlecase: false # Transform title into titlecaseexternal_link: true # Open external links in new tabfilename_case: 0render_drafts: falsepost_asset_folder: truerelative_link: falsefuture: truehighlight: enable: true line_number: true auto_detect: false tab_replace: Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. 冲冲冲Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/06/01/hello-world/"}],"tags":[],"categories":[{"name":"日志","slug":"日志","link":"/categories/%E6%97%A5%E5%BF%97/"},{"name":"测试","slug":"测试","link":"/categories/%E6%B5%8B%E8%AF%95/"},{"name":"随想","slug":"随想","link":"/categories/%E9%9A%8F%E6%83%B3/"}]}